## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
```terraform
Plan: 3 to add, 1 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb_listener_rule.alt-domain-document-api-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-document-api-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 10
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "api.document.staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "api.document.staging.notification.alpha.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_listener_rule.alt-domain-document-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-document-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 20
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "document.staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "document.staging.notification.alpha.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_listener_rule.alt-domain-host-route[0] will be created
  + resource "aws_lb_listener_rule" "alt-domain-host-route" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
      + priority     = 40
      + tags_all     = (known after apply)

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "staging.notification.cdssandbox.xyz"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + host_header {
              + values = [
                  + "staging.notification.alpha.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id          = "d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
        name        = "notification-canada-ca-waf"
        tags        = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (6 unchanged attributes hidden)


      ~ rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-sms-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos-detected-load-balancer-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-api-high-request-count-warning"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
